{
  "backend/main.mo": "Main actor defining core types (Photo, Video, Event, SpecialMoment, Order) with their DTOs, includes blob storage mixin, access control integration, and provides public functions for CRUD operations on photos, videos, events, special moments, orders, user profiles, and footer content.",
  "backend/migration.mo": "Migration module defining old and new actor state types with a run function that transforms eventShortlists from Map<Principal, OldUserShortlist> to Map<Principal, [Text]> while preserving all other state fields.",
  "feature_evidence.json": "Feature evidence report documenting four high-confidence features connecting PhotoUploadSection, VideoUploadSection, EventManagementSection, and OrdersSection components to their respective backend handlers with ExternalBlob processing and mutation calls.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of frontend files including App.tsx with TanStack Router setup, useQueries.ts with React Query hooks for backend operations, and various page/component descriptions for photos, videos, events, admin, and other sections.",
  "frontend/index.html": "HTML entry point with SEO meta tags, Open Graph and Twitter card metadata, Google site verification, and canonical URL for Sumit Photo and Videography professional services site.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, admin, photos, videos, events, favorites, portfolio, business info, special moments, and detail pages, wrapped in ThemeProvider with Header, Footer, ProfileSetupModal, and Toaster components.",
  "frontend/src/components/admin/EventManagementSection.tsx": "Admin interface for creating events with name, description, date, optional password protection, and optional cover image upload with preview functionality.",
  "frontend/src/components/admin/FooterEditSection.tsx": "Disabled admin UI for editing footer settings including contact email and social media links (Facebook, Instagram, YouTube).",
  "frontend/src/components/admin/OrderLineItemsEditor.tsx": "A React component for editing order line items with fields for item name, quantity, and unit price. Provides add/remove functionality and syncs local state with parent component via onChange callback.",
  "frontend/src/components/admin/OrdersSection.tsx": "Admin section for managing orders with filtering by status, creating new orders via dialog, and displaying order lists. Handles order creation with customer details, dates, items, and payment information.",
  "frontend/src/components/admin/PhotoUploadSection.tsx": "Admin component for uploading multiple photos with metadata (name, description, category). Features file preview, progress tracking, and batch upload using ExternalBlob for blob storage.",
  "frontend/src/components/admin/ShortlistsSection.tsx": "Placeholder admin section for viewing user shortlists and favorites. Currently displays an empty state with no functionality implemented.",
  "frontend/src/components/admin/SpecialMomentManagementSection.tsx": "Placeholder admin section for creating and managing special moments. Currently shows a coming soon message with disabled create button.",
  "frontend/src/components/admin/UserStatisticsSection.tsx": "Placeholder admin section for viewing user engagement and activity statistics. Currently displays an empty state with no data available.",
  "frontend/src/components/admin/VideoUploadSection.tsx": "Admin component for uploading multiple videos with metadata (name, description). Features progress tracking and batch upload using ExternalBlob for blob storage.",
  "frontend/src/components/admin/VisitorsSection.tsx": "Placeholder admin section for viewing site visitor statistics and activity. Currently displays an empty state with no visitor data available.",
  "frontend/src/components/AdminAccessHelper.tsx": "Provides UI for users to claim admin access or assign admin roles to other principals, displaying the current user's principal ID with copy functionality and buttons to initialize access control or assign roles.",
  "frontend/src/components/EventPasswordPrompt.tsx": "Empty file with no content.",
  "frontend/src/components/Footer.tsx": "Renders a footer component displaying copyright information and a \"Built with caffeine.ai\" attribution link with a heart icon.",
  "frontend/src/components/Header.tsx": "Main navigation header with login/logout functionality, responsive desktop and mobile menus, and navigation links to Home, Photos, Videos, Events, and Admin pages.",
  "frontend/src/components/PhotoActions.tsx": "Reusable component providing like and download action buttons for photos with optional variant sizing and liked state styling.",
  "frontend/src/components/PhotosViewer.tsx": "Displays a responsive grid of photos with loading, error, and empty states, showing photo metadata and like counts on hover.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, blocking dismissal until profile setup is complete.",
  "frontend/src/components/QRCodeGenerator.tsx": "Empty file with no content.",
  "frontend/src/components/RouterNotFoundRedirect.tsx": "Automatically redirects users to the home page when a route is not found, displaying a temporary \"Redirecting...\" message.",
  "frontend/src/components/SEOHead.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance based on Internet Identity authentication state. Creates authenticated or anonymous actors and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including user profiles, admin access control, photos/videos, events, orders, shortlists, visitors, and footer content with mutation invalidation and toast notifications.",
  "frontend/src/hooks/useSwipeNavigation.ts": "Empty file, likely placeholder for swipe gesture navigation functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using OKLCH color space, defining design tokens for backgrounds, foregrounds, borders, and semantic colors.",
  "frontend/src/lib/blob-utils.ts": "Utility functions for working with ExternalBlob objects from blob-storage, providing URL conversion, byte extraction, and image download functionality.",
  "frontend/src/lib/order-utils.ts": "Utility functions for order calculations including safe BigInt parsing, currency formatting, line item totals, and remaining payment calculations.",
  "frontend/src/lib/qrcode-local.ts": "Empty file, likely placeholder for local QR code generation functionality.",
  "frontend/src/lib/qrcode-utils.ts": "Empty file, likely placeholder for QR code utility functions.",
  "frontend/src/lib/seo.ts": "Empty file, likely placeholder for SEO-related utilities.",
  "frontend/src/lib/time-utils.ts": "Utility functions for converting between HTML date strings and backend Time format (nanoseconds), with formatting functions for display.",
  "frontend/src/lib/upload-utils.ts": "Utility functions for converting File objects to ExternalBlob format for uploads, with optional progress tracking support.",
  "frontend/src/lib/useQRCodeLibrary.ts": "Empty file, likely placeholder for QR code library hook.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page with authentication checks, displaying tabbed sections for managing orders, photos, videos, events, moments, shortlists, visitors, stats, and footer content.",
  "frontend/src/pages/BusinessInfoPage.tsx": "Static business information page displaying contact details (email, phone, location) and social media links with hero section and card-based layout.",
  "frontend/src/pages/EventDetailPage.tsx": "Displays a placeholder page for viewing a specific event's gallery details, with a back button to return to the events list.",
  "frontend/src/pages/EventPage.tsx": "Shows a placeholder page for viewing a specific event overview, nearly identical to EventDetailPage with slightly different description text.",
  "frontend/src/pages/EventsPage.tsx": "Lists all events with sorting (newest/oldest) and filtering (all/public/protected) controls, fetching data via useGetAllEvents hook and displaying event cards with password protection badges.",
  "frontend/src/pages/FavoritesPage.tsx": "Displays user's favorited photos, requiring Internet Identity authentication and showing a login prompt for unauthenticated users or an empty state placeholder when authenticated.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and service cards for navigating to Photos, Videos, Events, Favorites, Portfolio, and About sections.",
  "frontend/src/pages/MediaGroupPage.tsx": "Placeholder page for viewing a specific media group collection with a back button to home.",
  "frontend/src/pages/PhotoDetailPage.tsx": "Placeholder page for viewing individual photo details with a back button to the photos gallery.",
  "frontend/src/pages/PhotosPage.tsx": "Main photos gallery page with sorting controls (newest/oldest) that fetches and displays photos using PhotosViewer component via useGetAllPhotos hook.",
  "frontend/src/pages/PortfolioPage.tsx": "Portfolio landing page with hero section and three feature cards (Photography, Videography, Events) that navigate to respective gallery pages.",
  "frontend/src/pages/RobotsPage.tsx": "Empty file, likely placeholder for robots.txt handling.",
  "frontend/src/pages/SitemapPage.tsx": "Empty file, likely placeholder for sitemap.xml handling.",
  "frontend/src/pages/SpecialMomentPage.tsx": "Detail page for individual special moments, displays moment ID from URL params with back navigation to the special moments list.",
  "frontend/src/pages/SpecialMomentsPage.tsx": "Gallery page for special moments collections with sorting controls and empty state message indicating admin can create moments.",
  "frontend/src/pages/VideosPage.tsx": "Videos gallery page requiring Internet Identity authentication, displays video grid with sorting controls and uses useGetAllVideos hook to fetch data.",
  "frontend/src/types/media.ts": "TypeScript type definitions for media entities (Photo, Video, EventDTO, EventImage) with ExternalBlob interface, SortedOrder enum, and various request types for uploads and event creation.",
  "frontend/src/types/orders.ts": "TypeScript type definitions for order management including Order, OrderItem, PaymentFields, OrderStatus enum, and request types for creating and updating orders.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extending colors (using CSS variables), container settings, border radius variables, accordion animations, and plugins for animations and typography.",
  "project_state.json": "Project state file tracking an event management platform with photo/video galleries, admin event creation, and customer order processing. Documents existing features for connecting upload components, event forms, and order forms to Motoko backend with Internet Identity authentication."
}