{
  "backend/main.mo": "Defines the backend canister’s data models for photos, videos, events, special moments, footer content, profiles, filters, and upload requests, including comparison helpers and storage mixins.",
  "backend/migration.mo": "Provides a migration that converts old orders to a new format by adding a default Pending status to each order.",
  "feature_evidence.json": "Lists feature evidence for order‑status functionality, mapping features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for various frontend files including pages, components, hooks, and styles.",
  "frontend/index.html": "HTML entry point setting meta tags, SEO metadata, and loading the main React app.",
  "frontend/src/App.tsx": "Sets up the main React router, global layout, theme provider, visitor recording, and route definitions for all site pages.",
  "frontend/src/components/admin/EventManagementSection.tsx": "Admin interface for creating, editing, deleting, and managing events, including images and passwords.",
  "frontend/src/components/admin/FooterEditSection.tsx": "Form UI for editing footer contact details and social media links, using query hooks to load and update data.",
  "frontend/src/components/admin/OrdersSection.tsx": "Admin interface to view, filter, create, edit, update status, and delete orders with modal dialogs and form handling.",
  "frontend/src/components/admin/PhotoUploadSection.tsx": "Handles selecting, previewing, batching, and uploading photos with progress tracking and deletion support.",
  "frontend/src/components/admin/ShortlistsSection.tsx": "Displays user shortlists grouped by event with statistics and event filtering.",
  "frontend/src/components/admin/SpecialMomentManagementSection.tsx": "Allows admins to create special moments and upload images with compression, progress tracking, and deletion.",
  "frontend/src/components/admin/UserStatisticsSection.tsx": "Shows photo-related statistics such as totals, likes, averages, and most‑liked photos with a table view.",
  "frontend/src/components/admin/VideoUploadSection.tsx": "UI for selecting, uploading, previewing, and deleting videos with progress tracking and admin controls.",
  "frontend/src/components/admin/VisitorsSection.tsx": "Admin table displaying paginated site visitors with roles, timestamps, and navigation controls.",
  "frontend/src/components/AdminAccessHelper.tsx": "UI helper shown when a user lacks admin rights, displaying their principal and instructions for obtaining admin access.",
  "frontend/src/components/EventPasswordPrompt.tsx": "Modal dialog for entering and validating a password to access protected event pages.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with contact email, social links, and credits using data from footer content.",
  "frontend/src/components/Header.tsx": "Provides the site header with navigation, authentication handling, and optional admin link support.",
  "frontend/src/components/PhotoActions.tsx": "Displays like and download buttons for a photo, handling auth checks and download logic.",
  "frontend/src/components/PhotosViewer.tsx": "Fullscreen photo viewer with escape-to-close, scroll lock, image display, and action controls.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal prompting new authenticated users to create a profile and save their name.",
  "frontend/src/components/QRCodeGenerator.tsx": "Empty placeholder component file.",
  "frontend/src/components/RouterNotFoundRedirect.tsx": "Redirects unknown photo detail routes to the gallery and shows a not‑found fallback screen.",
  "frontend/src/components/SEOHead.tsx": "Applies SEO meta tags for pages based on predefined configs and optional overrides.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, invalidating queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, stored identities, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks wrapping backend actor calls for profiles, admin checks, media, events, and orders.",
  "frontend/src/hooks/useSwipeNavigation.ts": "Empty placeholder hook file for swipe navigation functionality.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark cinematic themes, base styles, scrollbars, and utility classes.",
  "frontend/src/lib/blob-utils.ts": "Utilities for converting ExternalBlob objects to URLs or bytes, converting images to JPEG, and downloading single or multiple images.",
  "frontend/src/lib/qrcode-local.ts": "Empty file.",
  "frontend/src/lib/qrcode-utils.ts": "Empty file.",
  "frontend/src/lib/seo.ts": "Functions for updating meta tags and Open Graph data plus predefined SEO configurations.",
  "frontend/src/lib/time-utils.ts": "Helpers to convert backend nanosecond timestamps to dates and formatted strings and vice versa.",
  "frontend/src/lib/upload-utils.ts": "Empty file.",
  "frontend/src/lib/useQRCodeLibrary.ts": "Empty file.",
  "frontend/src/main.tsx": "Application entry point mounting React app with Internet Identity and React Query providers.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page handling authentication, admin checks, and rendering admin management sections.",
  "frontend/src/pages/BusinessInfoPage.tsx": "Business info page showing services and contact details, using SEO metadata and footer content.",
  "frontend/src/pages/EventDetailPage.tsx": "Event detail page showing event info and gallery with lightbox view using blob URLs.",
  "frontend/src/pages/EventPage.tsx": "Displays a detailed event page with authentication, password prompts, image shortlist toggling, and image downloading.",
  "frontend/src/pages/EventsPage.tsx": "Shows a sortable list of events with authentication gating and a cinematic UI layout.",
  "frontend/src/pages/FavoritesPage.tsx": "Empty placeholder file for a favorites page.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a cinematic hero section, service highlights, and navigation to galleries.",
  "frontend/src/pages/MediaGroupPage.tsx": "Empty placeholder for a media group page.",
  "frontend/src/pages/PhotoDetailPage.tsx": "Empty placeholder for a photo detail page.",
  "frontend/src/pages/PhotosPage.tsx": "Displays sortable photo gallery with viewer modal and scroll restoration.",
  "frontend/src/pages/PortfolioPage.tsx": "Empty placeholder for a portfolio page.",
  "frontend/src/pages/RobotsPage.tsx": "Dynamically renders robots.txt content in-browser.",
  "frontend/src/pages/SitemapPage.tsx": "Generates and displays an XML sitemap client-side.",
  "frontend/src/pages/SpecialMomentPage.tsx": "Shows a special moment gallery with image downloads and batch download support.",
  "frontend/src/pages/SpecialMomentsPage.tsx": "Displays a gallery of special moments with sorting, loading states, and cinematic UI effects.",
  "frontend/src/pages/VideosPage.tsx": "Shows a video gallery with authentication gating, sorting controls, and a modal video viewer.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, persist, and clear URL and session-based parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, fonts, and component theming.",
  "project_state.json": "Defines current project state, including feature requests and order management requirements."
}