{
  "backend/main.mo": "Defines core types for photos, videos, events, special moments, and related upload/filter structures, with comparison helpers and blob-storage mixin integration.",
  "feature_evidence.json": "Lists feature evidence entries mapping UI/UX enhancement features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files, describing their purpose and visual/functional behavior.",
  "frontend/index.html": "Base HTML template setting SEO metadata, social tags, and loading the React application root.",
  "frontend/src/App.tsx": "Configures the TanStack Router with all site routes, wraps the app with theming and layout, and records visitors on load.",
  "frontend/src/components/admin/EventManagementSection.tsx": "Admin interface for creating, editing, deleting, and managing events, including images and password protection.",
  "frontend/src/components/admin/FooterEditSection.tsx": "Form UI to view and update footer contact details and social media links using query hooks.",
  "frontend/src/components/admin/OrdersSection.tsx": "Admin interface for filtering, creating, editing, updating status, and deleting orders with dialogs and validation.",
  "frontend/src/components/admin/PhotoUploadSection.tsx": "Handles selecting, previewing, validating, and batch‑uploading photos with progress tracking and deletion support.",
  "frontend/src/components/admin/ShortlistsSection.tsx": "Displays user shortlists grouped by event with stats and an event filter using admin query hooks.",
  "frontend/src/components/admin/SpecialMomentManagementSection.tsx": "Manages creation of special moments and uploading images with compression, progress tracking, and deletion.",
  "frontend/src/components/admin/UserStatisticsSection.tsx": "Computes and shows photo statistics including totals, averages, and top liked photos with a table view.",
  "frontend/src/components/admin/VideoUploadSection.tsx": "Handles selecting, previewing, uploading, and deleting videos with progress tracking and UI feedback.",
  "frontend/src/components/admin/VisitorsSection.tsx": "Displays paginated site visitor records with roles, timestamps, and admin-only access.",
  "frontend/src/components/AdminAccessHelper.tsx": "Helper UI that guides users through obtaining admin access, showing their principal and copyable commands.",
  "frontend/src/components/EventPasswordPrompt.tsx": "Dialog component prompting users to enter a password for protected events with validation and error display.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with branding, quick links, contact info, and social icons using fetched footer content.",
  "frontend/src/components/Header.tsx": "Displays the main site header with navigation, authentication controls, and an optional admin link.",
  "frontend/src/components/PhotoActions.tsx": "Provides like and download buttons for a photo, handling auth checks, state, and blob download logic.",
  "frontend/src/components/PhotosViewer.tsx": "Full-screen photo viewer with ESC-to-close, image display, details, and actions.",
  "frontend/src/components/ProfileSetupModal.tsx": "Prompts authenticated users without profiles to create one and saves the profile data.",
  "frontend/src/components/QRCodeGenerator.tsx": "Empty placeholder component.",
  "frontend/src/components/RouterNotFoundRedirect.tsx": "Redirects certain unknown photo-detail routes to /photos and shows a fallback not-found page.",
  "frontend/src/components/SEOHead.tsx": "Applies page-specific SEO metadata by updating meta tags on mount.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login state, identity loading, and logout functionality.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend features like user profiles, admin checks, photos, videos, events, and orders.",
  "frontend/src/hooks/useSwipeNavigation.ts": "Empty placeholder hook file.",
  "frontend/src/index.css": "Defines global Tailwind styles, custom color themes, typography, scrollbars, and utility classes for UI effects.",
  "frontend/src/lib/blob-utils.ts": "Provides helpers to convert ExternalBlob to URLs or bytes, convert images to JPEG, and download single or multiple images with memory-efficient processing.",
  "frontend/src/lib/qrcode-local.ts": "Empty file.",
  "frontend/src/lib/qrcode-utils.ts": "Empty file.",
  "frontend/src/lib/seo.ts": "Defines SEO config defaults and functions to update meta, Open Graph, Twitter, and canonical tags dynamically.",
  "frontend/src/lib/time-utils.ts": "Converts between HTML date strings and backend nanosecond timestamps and formats them for display.",
  "frontend/src/lib/upload-utils.ts": "Empty file.",
  "frontend/src/lib/useQRCodeLibrary.ts": "Empty file.",
  "frontend/src/main.tsx": "App entry initializing React, React Query, Internet Identity provider, and rendering the root component.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page controlling access via authentication and admin checks, rendering various management sections with tab navigation.",
  "frontend/src/pages/BusinessInfoPage.tsx": "Displays business information, services list, and social/contact details with SEO metadata.",
  "frontend/src/pages/EventDetailPage.tsx": "Shows an event’s details and gallery, loading images from blobs and providing a lightbox viewer.",
  "frontend/src/pages/EventPage.tsx": "Displays event details with authentication, password protection, image actions, and shortlist/download controls.",
  "frontend/src/pages/EventsPage.tsx": "Lists all events with sorting and authentication gating, showing a login prompt when unauthorized.",
  "frontend/src/pages/FavoritesPage.tsx": "Empty placeholder file for a favorites page.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, services overview, and navigation to gallery and contact.",
  "frontend/src/pages/MediaGroupPage.tsx": "Empty placeholder file for a media group page.",
  "frontend/src/pages/PhotoDetailPage.tsx": "Empty placeholder file for a photo detail page.",
  "frontend/src/pages/PhotosPage.tsx": "Displays photo gallery with sorting, lightbox viewer, and error/loading handling.",
  "frontend/src/pages/PortfolioPage.tsx": "Empty placeholder file for a portfolio page.",
  "frontend/src/pages/RobotsPage.tsx": "Renders and displays robots.txt content dynamically in the browser.",
  "frontend/src/pages/SitemapPage.tsx": "Generates and displays sitemap.xml content directly in the browser.",
  "frontend/src/pages/SpecialMomentPage.tsx": "Shows a special moment's images with individual and batch download features.",
  "frontend/src/pages/SpecialMomentsPage.tsx": "Displays a sortable gallery of special moments with loading, error, and empty states using themed UI components.",
  "frontend/src/pages/VideosPage.tsx": "Shows a sortable video gallery with authentication gating, loading states, and a modal for video playback.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and sessionStorage parameters with hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, shadows, and container settings for a custom themed UI.",
  "project_state.json": "Tracks project metadata, features, and pending requests for a UI styling update initiative."
}