{
  "backend/main.mo": "Defines actor with types and comparators for photos, videos, events, special moments, and related upload/filter DTOs, integrating blob storage and migration mixins.",
  "backend/migration.mo": "Migration module converting old photo, event, and user profile structures into new versions by adding missing fields like category and default profile data.",
  "feature_evidence.json": "Feature evidence report listing features, associated frontend files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend files describing routing, pages, components, hooks, and styling.",
  "frontend/index.html": "Base HTML template defining metadata, SEO tags, root mount point, and script entry for the frontend app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all main sections with layout, theme provider, toaster, and profile modal.",
  "frontend/src/components/admin/EventManagementSection.tsx": "Placeholder UI for event management with disabled create button and coming-soon message.",
  "frontend/src/components/admin/FooterEditSection.tsx": "Provides disabled form fields for editing footer contact and social links.",
  "frontend/src/components/admin/OrderLineItemsEditor.tsx": "Allows adding, editing, and removing order line items and syncs changes to parent state.",
  "frontend/src/components/admin/OrdersSection.tsx": "Full CRUD UI for orders including create, edit, filter by status, and manage order items.",
  "frontend/src/components/admin/PhotoUploadSection.tsx": "Placeholder UI for photo upload functionality with disabled upload button.",
  "frontend/src/components/admin/ShortlistsSection.tsx": "Displays a placeholder for user shortlists with no current data.",
  "frontend/src/components/admin/SpecialMomentManagementSection.tsx": "UI placeholder card for managing special moments with disabled create button.",
  "frontend/src/components/admin/UserStatisticsSection.tsx": "Displays placeholder user statistics card with no data available yet.",
  "frontend/src/components/admin/VideoUploadSection.tsx": "Placeholder interface for video upload and management with disabled upload button.",
  "frontend/src/components/admin/VisitorsSection.tsx": "Shows placeholder visitor statistics card indicating no data yet.",
  "frontend/src/components/AdminAccessHelper.tsx": "UI helper component guiding users through gaining admin access, showing principal ID, and offering copy actions and instructions.",
  "frontend/src/components/EventPasswordPrompt.tsx": "Empty file with no implemented content.",
  "frontend/src/components/Footer.tsx": "Renders a footer with the current year and a link to caffeine.ai including a referral identifier.",
  "frontend/src/components/Header.tsx": "Provides a responsive header with navigation links and login/logout handling using Internet Identity.",
  "frontend/src/components/PhotoActions.tsx": "Displays like and download buttons for a photo with optional large layout and callbacks.",
  "frontend/src/components/PhotosViewer.tsx": "Shows a grid of photo placeholders or an empty state message when no photos are available.",
  "frontend/src/components/ProfileSetupModal.tsx": "Prompts newly authenticated users to enter their name and saves the profile via a mutation.",
  "frontend/src/components/QRCodeGenerator.tsx": "File is empty with no implemented component.",
  "frontend/src/components/RouterNotFoundRedirect.tsx": "Redirects unknown routes to the home page and shows a brief redirect message.",
  "frontend/src/components/SEOHead.tsx": "File is empty with no implemented component.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, admin checks, and placeholder order operations.",
  "frontend/src/hooks/useSwipeNavigation.ts": "Empty file reserved for swipe navigation hook.",
  "frontend/src/index.css": "Tailwind base styles and custom color themes for light and dark modes.",
  "frontend/src/lib/blob-utils.ts": "Helpers for converting ExternalBlob objects to URLs, bytes, and downloading images.",
  "frontend/src/lib/order-utils.ts": "Utility functions for parsing, validating, and calculating order-related numeric values.",
  "frontend/src/lib/qrcode-local.ts": "Empty file reserved for local QR code utilities.",
  "frontend/src/lib/qrcode-utils.ts": "Empty file reserved for QR code utility functions.",
  "frontend/src/lib/seo.ts": "Empty file intended for SEO-related helpers.",
  "frontend/src/lib/time-utils.ts": "Converts dates to backend time format and formats timestamps into readable strings.",
  "frontend/src/lib/upload-utils.ts": "Empty file reserved for upload helper functions.",
  "frontend/src/lib/useQRCodeLibrary.ts": "Empty file intended for a QR code library integration hook.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity provider before rendering the app.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that checks authentication and admin status, showing various management tabs when authorized.",
  "frontend/src/pages/BusinessInfoPage.tsx": "Displays business contact details and social media links with styled sections.",
  "frontend/src/pages/EventDetailPage.tsx": "Shows a placeholder event detail view based on the URL ID with navigation back to the events list.",
  "frontend/src/pages/EventPage.tsx": "Similar to EventDetailPage, presenting a basic event overview placeholder for a given ID.",
  "frontend/src/pages/EventsPage.tsx": "Lists events with sorting and filtering controls, currently showing a placeholder when no events exist.",
  "frontend/src/pages/FavoritesPage.tsx": "Shows favorite photos or prompts login if unauthenticated, with placeholder content for empty favorites.",
  "frontend/src/pages/HomePage.tsx": "Landing page offering navigation to photos, videos, events, and other sections with feature cards.",
  "frontend/src/pages/MediaGroupPage.tsx": "Displays a media group detail placeholder using the route ID with navigation back to home.",
  "frontend/src/pages/PhotoDetailPage.tsx": "Shows a single photo detail placeholder based on the route ID with a back-to-photos button.",
  "frontend/src/pages/PhotosPage.tsx": "Renders a photo gallery page with sorting, category filters, and a placeholder collection display.",
  "frontend/src/pages/PortfolioPage.tsx": "Presents a portfolio page with featured work categories and navigation buttons to photos, videos, and other sections.",
  "frontend/src/pages/RobotsPage.tsx": "Empty page file with no content.",
  "frontend/src/pages/SitemapPage.tsx": "Empty page file with no content.",
  "frontend/src/pages/SpecialMomentPage.tsx": "Shows details for a specific special moment using the route ID with a back-navigation button.",
  "frontend/src/pages/SpecialMomentsPage.tsx": "Displays a special moments listing with sorting controls and a placeholder collection message.",
  "frontend/src/pages/VideosPage.tsx": "Renders a video gallery with authentication gating and sorting controls, showing placeholders when unauthenticated.",
  "frontend/src/types/orders.ts": "Defines TypeScript types for orders, items, payments, and update requests mirroring backend structures.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them from storage or the hash.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for animations and typography.",
  "project_state.json": "Stores the project’s state, including known issues, existing features, and pending restoration requests for previously removed app sections."
}