{
  "backend/main.mo": "Defines data models and comparators for photos, videos, events, special moments, and related upload/filter types, integrating blob storage and access control.",
  "feature_evidence.json": "Lists implemented features with associated source files, components, tests, and confidence metadata for feature tracking.",
  "frontend-file-summaries.txt": "Provides human‑written summaries of multiple frontend files describing their purpose and functionality.",
  "frontend/index.html": "Base HTML entry point configuring SEO metadata and loading the React application.",
  "frontend/src/App.tsx": "Sets up the TanStack Router structure, global layout, theme provider, visitor recording, and routes for all main pages.",
  "frontend/src/components/admin/EventManagementSection.tsx": "Admin interface for creating, editing, deleting events, managing event images, and setting event passwords.",
  "frontend/src/components/admin/FooterEditSection.tsx": "Admin UI for editing footer contact details and social media links with validation and save handling.",
  "frontend/src/components/admin/PhotoUploadSection.tsx": "Handles selecting, previewing, batching, and uploading multiple photos with progress tracking and deletion support.",
  "frontend/src/components/admin/ShortlistsSection.tsx": "Displays user shortlists grouped by event, provides event filtering, and shows summary statistics.",
  "frontend/src/components/admin/SpecialMomentManagementSection.tsx": "Manages creation of special moments and uploading/deleting associated images with validation and upload progress.",
  "frontend/src/components/admin/UserStatisticsSection.tsx": "Computes and displays photo-related statistics and a table of most‑liked photos.",
  "frontend/src/components/admin/VideoUploadSection.tsx": "Supports selecting, previewing, uploading, and deleting videos with progress tracking.",
  "frontend/src/components/admin/VisitorsSection.tsx": "Admin-only table showing paginated visitor records with roles and timestamps.",
  "frontend/src/components/AdminAccessHelper.tsx": "UI helper showing a user's principal and instructions for granting admin access, including copy actions and re-init flow.",
  "frontend/src/components/EventPasswordPrompt.tsx": "Modal dialog prompting users to enter a password for protected events with validation and error handling.",
  "frontend/src/components/Footer.tsx": "Renders the footer with contact email, social media links, and a copyright line using fetched footer content.",
  "frontend/src/components/Header.tsx": "Provides site navigation, login/logout handling, mobile menu toggling, and conditional admin link display.",
  "frontend/src/components/PhotoActions.tsx": "Adds like and download actions for photos, handling authentication, mutation calls, and UI state.",
  "frontend/src/components/ProfileSetupModal.tsx": "Displays a modal prompting new authenticated users to set up their profile and submit their name.",
  "frontend/src/components/QRCodeGenerator.tsx": "Empty component file with no implemented logic.",
  "frontend/src/components/SEOHead.tsx": "Updates SEO meta tags based on the selected page configuration and optional overrides.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, managing login, stored identity, and status flags.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping backend actor methods for user profiles, admin checks, media, events, and visitors.",
  "frontend/src/hooks/useSwipeNavigation.ts": "Adds touch-based left/right swipe detection with configurable thresholds.",
  "frontend/src/index.css": "Tailwind-based global styles defining cinematic light/dark themes, scrollbars, textures, and utilities.",
  "frontend/src/lib/blob-utils.ts": "Utilities for converting, downloading, and batch-processing ExternalBlob images, including JPEG conversion.",
  "frontend/src/lib/qrcode-local.ts": "Empty placeholder file for local QR code utilities.",
  "frontend/src/lib/qrcode-utils.ts": "Empty utility file for QR code-related functionality.",
  "frontend/src/lib/seo.ts": "Provides SEO configuration defaults and functions to dynamically update meta, Open Graph, Twitter Card, and canonical tags.",
  "frontend/src/lib/upload-utils.ts": "Empty placeholder file with no implemented functionality.",
  "frontend/src/lib/useQRCodeLibrary.ts": "Empty placeholder file with no implemented functionality.",
  "frontend/src/main.tsx": "Application entry point that sets up React rendering with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page handling authentication, admin checks, and rendering various management sections.",
  "frontend/src/pages/BusinessInfoPage.tsx": "Renders business info, service descriptions, and footer data with a hero section and SEO integration.",
  "frontend/src/pages/EventDetailPage.tsx": "Displays a single event’s details and images with a lightbox viewer and loading states.",
  "frontend/src/pages/EventPage.tsx": "Full event page supporting authentication, password protection, image gallery, shortlisting, and downloads.",
  "frontend/src/pages/EventsPage.tsx": "Renders an events list with sorting, authentication gating, and cinematic UI elements using data from useGetAllEventsSorted.",
  "frontend/src/pages/FavoritesPage.tsx": "Empty file placeholder for a favorites page.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage hero, service sections, and links to photo and video galleries with cinematic styling.",
  "frontend/src/pages/MediaGroupPage.tsx": "Empty file placeholder for a media group page.",
  "frontend/src/pages/PhotoDetailPage.tsx": "Shows a single photo with swipe, keyboard navigation, and actions, loading photos via useGetAllPhotosSorted.",
  "frontend/src/pages/PhotosPage.tsx": "Displays the photo gallery with sorting, loading states, and navigation to individual photo pages.",
  "frontend/src/pages/PortfolioPage.tsx": "Empty file placeholder for a portfolio page.",
  "frontend/src/pages/RobotsPage.tsx": "Generates and displays robots.txt content dynamically in the browser.",
  "frontend/src/pages/SitemapPage.tsx": "Generates an XML sitemap and displays it while providing a downloadable file.",
  "frontend/src/pages/SpecialMomentPage.tsx": "Shows a special moment's images with individual and batch download support, using useGetSpecialMoment.",
  "frontend/src/pages/SpecialMomentsPage.tsx": "React page that fetches and displays sorted special moments with cinematic styling, sort controls, loading/error states, and a grid of moment cards.",
  "frontend/src/pages/VideosPage.tsx": "Video gallery page that requires authentication, supports sorting, shows a login prompt when unauthenticated, and displays selectable videos with a modal viewer.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, storing/retrieving them in sessionStorage, and managing persisted URL state including hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, typography, shadows, containers, and plugin integrations.",
  "project_state.json": "Project metadata describing site status, existing features, known issues, and pending requests for the Sumit Photo and Videography project."
}