{
  "kind": "build_request",
  "title": "Restore Photos/Videos/Events sections alongside Orders",
  "projectName": "Studio Portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Restore the application’s previously available top-level sections so the UI is not limited to the Orders admin section. At minimum, re-add working routes and pages for Photos, Videos, Events, and any related sections that previously existed in the app (e.g., Special Moments, Favorites, Portfolio, Business Info, Media Groups) so users can navigate to them again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "You removed everything and only showing order section restore all the section like photos videos events etc as like previous"
        ]
      },
      "acceptanceCriteria": [
        "App routing includes dedicated routes (not placeholders) for Photos, Videos, and Events pages in addition to existing Home and Admin routes.",
        "Navigating to the restored routes renders non-empty pages (not blank files) and does not redirect to Home due to notFound routing.",
        "Header navigation provides visible links (or a menu) to reach the restored sections (Photos/Videos/Events at minimum) without needing to type URLs.",
        "Orders admin section remains accessible at /admin and continues to function as-is."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Restore the content and UI structure for the restored sections (Photos, Videos, Events, etc.) so they resemble the previous multi-section experience rather than an order-only landing page. Ensure user-facing labels and messages are in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "restore all the section like photos videos events etc as like previous"
        ]
      },
      "acceptanceCriteria": [
        "Home page is updated so it is not exclusively an “Order Management System” marketing page; it includes entry points to the restored sections (Photos/Videos/Events at minimum).",
        "Each restored section page includes basic layout scaffolding (title, description, primary actions) and does not show empty/blank content.",
        "All user-facing text introduced/updated by this change is in English."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Restore backend support for the non-order sections (Photos, Videos, Events, Special Moments, Favorites/likes, shortlists, visitors, footer content as applicable) so the restored frontend sections can load and mutate data without runtime failures.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "restore all the section like photos videos events etc as like previous"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes query and update methods needed by the restored sections (at minimum: list and get for Photos/Videos/Events; and admin-only create/upload/update/delete where applicable).",
        "Access control is enforced consistently: public vs authenticated vs admin actions are protected appropriately (e.g., admin-only uploads/management).",
        "The restored frontend sections can call the backend actor without throwing runtime traps for missing methods (e.g., “method not found”)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Restore admin panel navigation and sections beyond Orders (e.g., Photo upload/management, Video upload/management, Event management, Special moment management, Shortlists, Visitors, Footer editing, User statistics) so admins can manage all previously available content areas from the admin UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "restore all the section like photos videos events etc as like previous"
        ]
      },
      "acceptanceCriteria": [
        "Admin page no longer renders only OrdersSection; it provides a way to access additional admin sections (tabs/side navigation/accordion is acceptable).",
        "Each admin section that is currently an empty placeholder renders functional UI (not empty files), at least for listing existing entities and providing create/update/delete or upload flows where applicable.",
        "Admin access checks remain in place; non-admin users still see the admin access helper flow."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI is read-only and must be composed, not modified).",
    "Do not edit immutable hook entrypoints: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo changes if an upgrade requires state migration.",
    "Keep the existing Orders functionality working and accessible at /admin."
  ],
  "nonGoals": [
    "Do not introduce third-party authentication providers (only Internet Identity is supported).",
    "Do not add external databases or non-IC storage services.",
    "Do not add real-time features such as WebSockets or push notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}