{
  "kind": "build_request",
  "title": "Add full order management in Orders section",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the Orders section is clearly discoverable and accessible for administrators: the Admin Panel must include an \"Orders\" tab and render the existing Orders management UI when selected, and non-admin users must not be able to access Orders management screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add full order managment in order section"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as an admin, the Admin Panel displays an \"Orders\" tab and selecting it shows the Orders management UI.",
        "When logged in as a non-admin, Orders management UI cannot be accessed (direct navigation or UI entry points) and the user sees the existing non-admin access helper experience on the Admin page.",
        "User-facing labels and messages in the Orders UI are in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement \"full order management\" capabilities in the Orders section by adding an order lifecycle status and management actions: store an order status (at minimum: Pending, Fulfilled, Cancelled), allow admins to update the status, and add UI controls to filter the orders list by status and quickly mark an order as Fulfilled/Cancelled.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add full order managment in order section"
        ]
      },
      "acceptanceCriteria": [
        "Backend Order data includes a status field and persists it for each order.",
        "Admins can create an order and it defaults to a defined initial status (e.g., Pending).",
        "Admins can update an order’s status without changing the immutable order id and existing order date.",
        "Orders list UI provides a status filter and the list updates accordingly.",
        "Admins can mark an order as Fulfilled or Cancelled from the Orders section UI and the change is reflected after refresh/reload."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add necessary backend canister methods and React Query hooks (following existing patterns) to support the new order status field and status update operations, enforcing admin-only access for mutations and appropriate access for queries used by the admin UI.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add full order managment in order section"
        ]
      },
      "acceptanceCriteria": [
        "All new backend order mutation methods (status changes) trap or reject when called by non-admin principals.",
        "Frontend uses React Query hooks to call the new backend methods and invalidates/refetches the orders list after successful mutations.",
        "TypeScript types for Order/status and request payloads are updated so the OrdersSection compiles without `any` casts."
      ]
    },
    {
      "id": "REQ-4",
      "text": "If adding order status changes the stable/persistent state shape, add a conditional Motoko migration to preserve existing deployed orders by initializing the new status field for all existing orders.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "Add full order managment in order section"
        ]
      },
      "acceptanceCriteria": [
        "Upgrading the canister does not erase existing orders.",
        "All pre-existing orders receive a valid default status after upgrade.",
        "Migration is conditional (only runs when upgrading from older state that lacks the new field)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not edit files under frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for all user-facing text."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (only Internet Identity).",
    "Do not add external databases or external backend services.",
    "Do not implement real-time updates (no WebSockets/live subscriptions).",
    "Do not add payments/invoicing unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}