{
  "kind": "build_request",
  "title": "Make all website sections and options more colorful and visually appealing",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the global Tailwind/CSS theme tokens to use a more colorful, modern palette (without relying on blue/purple as the main identity colors) and ensure the palette works consistently in both light and dark mode across all pages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All the section and option in my website make them some colourfull and good looking"
        ]
      },
      "acceptanceCriteria": [
        "Light mode and dark mode both have clearly distinct, colorful primary/accent colors (not predominantly blue/purple).",
        "Primary, accent, muted, border, and ring colors remain readable and accessible (no low-contrast text on backgrounds).",
        "No backend changes are required for the styling update."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Apply the refreshed colorful styling consistently across all major site sections (Header, Footer, Home, Photos, Videos, Events, Special Moments, Business Info, and Admin) by improving section headers, cards, and call-to-action areas using gradients, accent borders, and hover/focus states.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All the section and option in my website make them some colourfull and good looking"
        ]
      },
      "acceptanceCriteria": [
        "All main pages render with a cohesive, colorful look (section headings use consistent gradient treatment; cards/containers use consistent accent/border/shadow language).",
        "Header and Footer visually match the new theme (nav active/hover states and icons reflect the updated accent/primary colors).",
        "Interactive elements (buttons, links) have clear hover, active, and focus-visible styles that match the new theme."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Make all key “options” and controls (Select dropdown triggers/menus, badges, filters, tabs if present, and admin form controls) more visually appealing by enhancing color, spacing, and state styling (hover/selected/disabled/error) while keeping usability and readability high.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All the section and option in my website make them some colourfull and good looking"
        ]
      },
      "acceptanceCriteria": [
        "Select controls (trigger and dropdown content) have improved styling and clearly visible selected/hover states.",
        "Badges (e.g., Protected) and status indicators use a more vibrant, theme-consistent color treatment while staying readable.",
        "Form inputs in admin areas visibly communicate focus and error states with theme-consistent colors and rings."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Establish and enforce one coherent visual theme direction for the whole UI (colors, typography emphasis, spacing rhythm, gradients, and shadows) so the site feels intentionally designed and consistently “good looking” across sections.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "All the section and option in my website make them some colourfull and good looking"
        ]
      },
      "acceptanceCriteria": [
        "A single, consistent design language is evident across pages (same gradient style, same card treatment, same button hierarchy).",
        "No page looks “unstyled” or visually inconsistent relative to the others (especially Admin vs public pages)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose them via props/className and theme tokens instead).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx (immutable paths).",
    "Keep all changes within the existing React + Tailwind + shadcn setup; do not add new frameworks.",
    "Do not introduce any new backend schema/state changes for this styling-only request."
  ],
  "nonGoals": [
    "Adding new application features (e.g., new pages, new admin capabilities, new order logic).",
    "Changing site content/copy beyond what is required for styling consistency.",
    "Implementing third-party themes or external CSS frameworks."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}