{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Refresh UI theme with a colorful, modern palette and consistent styling across all sections",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the global Tailwind/CSS theme tokens with a modern, colorful palette (not predominantly blue/purple) that works consistently in light and dark mode.",
      "acceptanceCriteria": [
        "Light mode and dark mode both have clearly distinct, colorful primary/accent colors (not predominantly blue/purple).",
        "Primary, accent, muted, border, and ring colors remain readable and accessible (no low-contrast text on backgrounds).",
        "No backend changes are required for the styling update."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update CSS theme tokens (background/foreground/card/popover/primary/accent/muted/border/ring/chart) to a more colorful, modern identity that avoids blue/purple as the dominant hues; ensure both :root and .dark are updated and remain readable."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Adjust Tailwind theme extensions (e.g., glow shadow definitions and any theme-linked utilities) to better match the refreshed palette while continuing to reference the CSS tokens."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Apply the refreshed styling consistently across Header, Footer, major public pages, and Admin by standardizing section headers, cards, and CTA styling (gradients, accent borders, hover/focus states).",
      "acceptanceCriteria": [
        "All main pages render with a cohesive, colorful look (section headings use consistent gradient treatment; cards/containers use consistent accent/border/shadow language).",
        "Header and Footer visually match the new theme (nav active/hover states and icons reflect the updated accent/primary colors).",
        "Interactive elements (buttons, links) have clear hover, active, and focus-visible styles that match the new theme."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add/adjust shared utilities for a consistent design language (e.g., standardized gradient heading treatment, section background overlays, card surfaces, CTA surfaces, and hover/focus-visible patterns) using Tailwind layers without touching shadcn UI component sources."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update header styling to better express the new palette: stronger colorful brand mark, improved nav hover/active treatments, and clearer focus-visible styling for navigation and auth button while keeping current layout/behavior."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Align footer styling with the updated theme (social icon hover states, separators, accent highlights, and CTA-like contact link treatment) to match header and page sections."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Apply the standardized section heading, card, and CTA treatments (gradient headings, accent borders, cohesive shadows/hover lifts) so the home hero/services/CTA sections match the refreshed theme consistently."
        },
        {
          "path": "frontend/src/pages/PhotosPage.tsx",
          "operation": "modify",
          "description": "Update gallery section header, sort control container, and photo cards to use the same colorful gradients/accent borders/hover states as other sections, keeping existing layout and functionality."
        },
        {
          "path": "frontend/src/pages/VideosPage.tsx",
          "operation": "modify",
          "description": "Refresh video page heading, sort controls, video cards, and the video modal styling so they match the new colorful theme with consistent hover/focus and surface treatments."
        },
        {
          "path": "frontend/src/pages/EventsPage.tsx",
          "operation": "modify",
          "description": "Make the Events page consistent with the new theme: section heading treatment, select styling wrapper, card surfaces, and protected-state visuals (badge/icon) using the updated palette."
        },
        {
          "path": "frontend/src/pages/SpecialMomentsPage.tsx",
          "operation": "modify",
          "description": "Apply the new theme consistently to Special Moments: gradient heading, cards, and CTAs with accent borders and hover/focus states aligned to the updated design language."
        },
        {
          "path": "frontend/src/pages/BusinessInfoPage.tsx",
          "operation": "modify",
          "description": "Update Business Info section headers and service cards to use the same colorful, cohesive surface styling and spacing rhythm used across other public pages."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Ensure the Admin page container/sections adopt the same theme direction (headings, surfaces, spacing, and consistent colorful accents) so it no longer feels visually separate from public pages."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Improve the visual styling of key options/controls (selects, badges, filters, and admin form controls) with better spacing and clear hover/selected/disabled/error states while maintaining usability.",
      "acceptanceCriteria": [
        "Select controls (trigger and dropdown content) have improved styling and clearly visible selected/hover states.",
        "Badges (e.g., Protected) and status indicators use a more vibrant, theme-consistent color treatment while staying readable.",
        "Form inputs in admin areas visibly communicate focus and error states with theme-consistent colors and rings."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Introduce/adjust global utility classes that can be applied from usage sites to standardize control surfaces (select triggers/menus), badges/status chips, and form field focus/error ring treatments—without editing any files under frontend/src/components/ui."
        },
        {
          "path": "frontend/src/pages/EventsPage.tsx",
          "operation": "modify",
          "description": "Enhance SelectTrigger/SelectContent styling via className composition for clearer hover/selected states, and refine the Protected badge styling to be more vibrant yet readable under both themes."
        },
        {
          "path": "frontend/src/pages/PhotosPage.tsx",
          "operation": "modify",
          "description": "Refine the photo sort Select styling (trigger/menu) to match the enhanced control styling and ensure focus-visible states are clearly indicated."
        },
        {
          "path": "frontend/src/pages/VideosPage.tsx",
          "operation": "modify",
          "description": "Refine the video sort Select styling (trigger/menu) and ensure modal interactive controls are consistent with the updated focus/hover language."
        },
        {
          "path": "frontend/src/pages/SpecialMomentsPage.tsx",
          "operation": "modify",
          "description": "Refine the special moments sort Select styling to adopt the improved colorful control surface and state styling."
        },
        {
          "path": "frontend/src/components/admin/OrdersSection.tsx",
          "operation": "modify",
          "description": "Update admin form controls and interactive options (filters/selects/inputs/buttons inside this section) by composing className props to improve spacing and to clearly show hover/focus-visible/error states using theme-consistent colors."
        },
        {
          "path": "frontend/src/components/admin/EventManagementSection.tsx",
          "operation": "modify",
          "description": "Enhance admin event management controls (forms, selects, status indicators, destructive actions) with theme-consistent focus/error rings and more vibrant option styling via className composition."
        },
        {
          "path": "frontend/src/components/admin/PhotoUploadSection.tsx",
          "operation": "modify",
          "description": "Improve upload section controls (file pickers/actions/progress areas) with more colorful, readable status styling and clearer button/option states using theme utilities and composed className."
        },
        {
          "path": "frontend/src/components/admin/VideoUploadSection.tsx",
          "operation": "modify",
          "description": "Enhance video upload/admin controls styling (inputs, buttons, progress/status) to follow the same colorful option/control treatment and accessible focus/error states."
        },
        {
          "path": "frontend/src/components/admin/FooterEditSection.tsx",
          "operation": "modify",
          "description": "Improve Footer edit form controls (inputs/textareas/buttons) with consistent spacing and theme-aligned focus/error rings and button hierarchy via className composition."
        },
        {
          "path": "frontend/src/components/admin/VisitorsSection.tsx",
          "operation": "modify",
          "description": "Refine table controls/pagination options styling so interactive elements have clear hover/active/focus states and match the new palette."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Define and enforce a single coherent visual direction (colors, typography emphasis, spacing rhythm, gradients, shadows) so all sections—including Admin—feel intentionally designed and consistent.",
      "acceptanceCriteria": [
        "A single, consistent design language is evident across pages (same gradient style, same card treatment, same button hierarchy).",
        "No page looks “unstyled” or visually inconsistent relative to the others (especially Admin vs public pages)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Consolidate the design language into reusable utility patterns (consistent heading gradients, surface treatments, shadow/glow levels, spacing rhythm helpers, and hover-lift behavior) that can be applied across pages/components."
        },
        {
          "path": "frontend/src/components/PhotoActions.tsx",
          "operation": "modify",
          "description": "Align action buttons/controls styling with the unified theme (button hierarchy, hover/focus-visible states, and icon color accents) to ensure consistent interaction styling inside cards/viewers."
        },
        {
          "path": "frontend/src/components/EventPasswordPrompt.tsx",
          "operation": "modify",
          "description": "Update the protected-event password prompt modal styling to match the unified theme direction (surface, accent border, focus rings, and CTA button hierarchy) while preserving existing behavior."
        },
        {
          "path": "frontend/src/components/AdminAccessHelper.tsx",
          "operation": "modify",
          "description": "Restyle the admin access helper screen to match the same heading, surface, and CTA patterns as public pages so the Admin experience feels cohesive."
        }
      ]
    }
  ]
}