{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin Orders: status lifecycle management, filtering, and guarded access",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure Orders management is discoverable in the Admin Panel for admins and inaccessible to non-admin users.",
      "acceptanceCriteria": [
        "When logged in as an admin, the Admin Panel displays an \"Orders\" tab and selecting it shows the Orders management UI.",
        "When logged in as a non-admin, Orders management UI cannot be accessed (direct navigation or UI entry points) and the user sees the existing non-admin access helper experience on the Admin page.",
        "User-facing labels and messages in the Orders UI are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Confirm/adjust Admin Panel tab label to \"Orders\" and ensure OrdersSection is only rendered for admin users (maintain the existing non-admin helper experience on /admin)."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Ensure the top-level navigation only exposes the Admin entry point to admins (and does not introduce any Orders-specific navigation for non-admin users)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add order status lifecycle management in the Orders section with status filtering and quick status actions for admins.",
      "acceptanceCriteria": [
        "Backend Order data includes a status field and persists it for each order.",
        "Admins can create an order and it defaults to a defined initial status (e.g., Pending).",
        "Admins can update an order’s status without changing the immutable order id and existing order date.",
        "Orders list UI provides a status filter and the list updates accordingly.",
        "Admins can mark an order as Fulfilled or Cancelled from the Orders section UI and the change is reflected after refresh/reload."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/OrdersSection.tsx",
          "operation": "modify",
          "description": "Extend the existing Orders management UI to display the current order status, add a status filter (e.g., All/Pending/Fulfilled/Cancelled), and add quick actions to mark an order as Fulfilled or Cancelled using the new status-update mutation hook. Keep all user-facing text in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks to support filtering orders by status and mutating order status, and wire them so the Orders list refetches/updates after a status change. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add/align React Query hooks and TypeScript types to support order status updates and ensure orders UI compiles without any casts.",
      "acceptanceCriteria": [
        "All new backend order mutation methods (status changes) trap or reject when called by non-admin principals.",
        "Frontend uses React Query hooks to call the new backend methods and invalidates/refetches the orders list after successful mutations.",
        "TypeScript types for Order/status and request payloads are updated so the OrdersSection compiles without `any` casts."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement status-focused hooks following existing patterns (query keys, enabled flags, and query invalidation). Add a status update mutation hook that invalidates the relevant orders queries on success, and add a status-based orders query hook that can be driven by the OrdersSection filter UI."
        },
        {
          "path": "frontend/src/components/admin/OrdersSection.tsx",
          "operation": "modify",
          "description": "Update OrdersSection to use the typed OrderStatus/UpdateOrderStatusRequest types (no any casts), call the new status mutation hook, and ensure it properly refetches/reflects status changes after mutation and after page refresh."
        }
      ]
    }
  ]
}