{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Studio Portal — Restore multi-section navigation and admin areas",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Re-add working top-level routes/pages for Photos, Videos, Events, and previously existing related sections; expose navigation links while keeping /admin Orders working.",
      "acceptanceCriteria": [
        "App routing includes dedicated routes (not placeholders) for Photos, Videos, and Events pages in addition to existing Home and Admin routes.",
        "Navigating to the restored routes renders non-empty pages (not blank files) and does not redirect to Home due to notFound routing.",
        "Header navigation provides visible links (or a menu) to reach the restored sections (Photos/Videos/Events at minimum) without needing to type URLs.",
        "Orders admin section remains accessible at /admin and continues to function as-is."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register TanStack Router routes for restored public sections: /photos, /videos, /events (minimum), and wire existing related pages that previously existed (e.g., /favorites, /portfolio, /business-info, /special-moments, /media-groups and any detail routes that already have page files) so they render real pages and are not caught by the notFound redirect."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update header navigation to include visible links (or a compact menu) for Photos, Videos, and Events (minimum) and keep Home and Admin links. Ensure the /admin link remains present and unchanged in behavior."
        },
        {
          "path": "frontend/src/pages/PhotosPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Photos landing page with section title, brief description, and primary actions (e.g., browse albums, view favorites) and wire in a reusable viewer component to avoid blank content."
        },
        {
          "path": "frontend/src/pages/VideosPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Videos landing page with section title, brief description, and primary actions (e.g., browse, filter) so it is a real page and not an empty placeholder."
        },
        {
          "path": "frontend/src/pages/EventsPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Events landing page with section title, brief description, and primary actions (e.g., view event list, open event details) so it is a real page and not an empty placeholder."
        },
        {
          "path": "frontend/src/pages/FavoritesPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Favorites page to restore the previously existing related section, including basic list scaffolding and clear empty-state messaging."
        },
        {
          "path": "frontend/src/pages/PortfolioPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Portfolio page to restore the previously existing related section, including basic layout scaffolding and sample tiles/sections (static or client-side placeholder data)."
        },
        {
          "path": "frontend/src/pages/BusinessInfoPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Business Info page to restore the previously existing related section, including basic contact/about scaffolding and clear labels."
        },
        {
          "path": "frontend/src/pages/SpecialMomentsPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Special Moments page to restore the previously existing related section, including a basic gallery/list scaffold and empty states."
        },
        {
          "path": "frontend/src/pages/SpecialMomentPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Special Moment detail page scaffold (title, metadata area, actions, and content region) to support navigation to an individual moment."
        },
        {
          "path": "frontend/src/pages/MediaGroupPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Media Group page scaffold (group title, description, and list/gallery region) to restore the previously existing related section."
        },
        {
          "path": "frontend/src/pages/EventDetailPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Event Detail page scaffold (title, date/time display area, access/visibility messaging, and media sections) to ensure event deep-links render content."
        },
        {
          "path": "frontend/src/pages/EventPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Event page scaffold (overview, calls to action) if it previously existed separately from Events/Detail pages; ensure it renders meaningful content."
        },
        {
          "path": "frontend/src/pages/PhotoDetailPage.tsx",
          "operation": "modify",
          "description": "Implement a non-empty Photo Detail page scaffold to support navigation from Photos lists into an individual photo view."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Restore user-facing content and UI structure for Photos/Videos/Events and related sections; update Home to reflect the multi-section experience with English-only labels.",
      "acceptanceCriteria": [
        "Home page is updated so it is not exclusively an “Order Management System” marketing page; it includes entry points to the restored sections (Photos/Videos/Events at minimum).",
        "Each restored section page includes basic layout scaffolding (title, description, primary actions) and does not show empty/blank content.",
        "All user-facing text introduced/updated by this change is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Revise Home content away from an order-only marketing page: add entry cards/CTAs to Photos, Videos, and Events (minimum) and optionally highlight related restored sections. Ensure all displayed text is in English."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update footer branding/copy so it matches the Studio Portal multi-section experience (not only orders). Ensure text is in English."
        },
        {
          "path": "frontend/src/components/PhotosViewer.tsx",
          "operation": "modify",
          "description": "Implement a basic, non-empty Photos viewer component used by Photos/Favorites/Special Moments pages: grid layout, selection handling, and an empty state. Where media previews are shown, plan for use of the blob-storage ExternalBlob direct URL when available. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/PhotoActions.tsx",
          "operation": "modify",
          "description": "Implement photo action controls UI (e.g., favorite/like toggle, share/copy link, download button scaffold) to restore prior interactivity and ensure pages are not empty."
        },
        {
          "path": "frontend/src/lib/blob-utils.ts",
          "operation": "modify",
          "description": "Add frontend utilities for media handling that align with blob-storage: creating ExternalBlob instances from File/bytes, reading direct URLs for preview/streaming, and optional upload progress wiring helpers. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Restore admin panel navigation and additional admin sections beyond Orders with functional, non-empty UIs while keeping existing admin access checks.",
      "acceptanceCriteria": [
        "Admin page no longer renders only OrdersSection; it provides a way to access additional admin sections (tabs/side navigation/accordion is acceptable).",
        "Each admin section that is currently an empty placeholder renders functional UI (not empty files), at least for listing existing entities and providing create/update/delete or upload flows where applicable.",
        "Admin access checks remain in place; non-admin users still see the admin access helper flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Keep existing authentication/admin gating logic intact, but add an admin navigation UI (tabs/side-nav) to switch between Orders and restored admin sections. Ensure OrdersSection remains available and working as-is within /admin."
        },
        {
          "path": "frontend/src/components/admin/PhotoUploadSection.tsx",
          "operation": "modify",
          "description": "Implement a functional Photo upload/management UI: list existing items (client-side state or query integration placeholder without runtime crashes), add/upload flow with file picker, preview, and basic edit/delete interactions. Use blob-storage ExternalBlob for preview/direct URL and upload progress wiring where appropriate. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/VideoUploadSection.tsx",
          "operation": "modify",
          "description": "Implement a functional Video upload/management UI: list, add/upload, and delete/update scaffolding with non-empty content. Use blob-storage ExternalBlob direct URL approach for previews/links and upload progress where appropriate. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/EventManagementSection.tsx",
          "operation": "modify",
          "description": "Implement a functional Event management UI: list events, create/edit form scaffolding (title/date/visibility), and delete action (client-side state or safe integration placeholder) so the section is not empty."
        },
        {
          "path": "frontend/src/components/admin/SpecialMomentManagementSection.tsx",
          "operation": "modify",
          "description": "Implement a functional Special Moments admin UI: list items, create/edit form scaffolding, and delete action. Where moments include media, structure the UI to display media via blob-storage direct URL when available. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/ShortlistsSection.tsx",
          "operation": "modify",
          "description": "Implement a functional Shortlists admin UI scaffold: list entries, view details, and basic management actions so the section is not empty."
        },
        {
          "path": "frontend/src/components/admin/VisitorsSection.tsx",
          "operation": "modify",
          "description": "Implement a functional Visitors admin UI scaffold: display visitor list/statistics layout with filters/date ranges (UI-only if necessary) and non-empty states."
        },
        {
          "path": "frontend/src/components/admin/FooterEditSection.tsx",
          "operation": "modify",
          "description": "Implement a functional Footer editing UI scaffold: editable fields (e.g., copyright text, links), preview area, and save/reset actions (client-side state or safe integration placeholder) so the section is not empty."
        },
        {
          "path": "frontend/src/components/admin/UserStatisticsSection.tsx",
          "operation": "modify",
          "description": "Implement a functional User statistics admin UI scaffold: summary cards and list/table layout with non-empty states."
        }
      ]
    }
  ]
}