{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend implementation for photo/video upload and event/order management system",
  "requirements": [
    {
      "id": "REQ-5",
      "summary": "Connect PhotoUploadSection to backend upload handler with multiple file selection and progress tracking",
      "acceptanceCriteria": [
        "File input accepts multiple photo files (JPEG, PNG, WebP)",
        "Each selected file is converted to ExternalBlob using upload-utils",
        "Upload mutation is called for each photo with name, description, category, and blob data",
        "Upload progress is displayed for each file",
        "Success message appears after all uploads complete",
        "Photo gallery refreshes automatically to show newly uploaded photos"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/PhotoUploadSection.tsx",
          "operation": "modify",
          "description": "Enable multiple file selection by adding the 'multiple' attribute to the file input element. Implement file iteration logic to process each selected file through upload-utils.ts to create ExternalBlob instances. For each photo, call the uploadPhoto mutation from useQueries.ts with name, description, category, and blob data. Track upload progress using ExternalBlob.withUploadProgress() and display progress indicators. Show success messages after all uploads complete and trigger photo gallery refresh by invalidating the 'photos' query key."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement the useUploadPhoto mutation hook that calls actor.uploadPhoto with PhotoVideoUploadRequest data (name, description, category, blob). Configure the mutation to invalidate the 'photos' query key on success to trigger automatic gallery refresh. Add proper error handling and return mutation state for UI feedback."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Connect VideoUploadSection to backend upload handler with multiple file selection and progress tracking",
      "acceptanceCriteria": [
        "File input accepts multiple video files (MP4, WebM, MOV)",
        "Each selected file is converted to ExternalBlob using upload-utils",
        "Upload mutation is called for each video with name, description, and blob data",
        "Upload progress is displayed for each file",
        "Success message appears after all uploads complete",
        "Video gallery refreshes automatically to show newly uploaded videos"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/VideoUploadSection.tsx",
          "operation": "modify",
          "description": "Enable multiple file selection by adding the 'multiple' attribute to the file input element. Implement file iteration logic to process each selected file through upload-utils.ts to create ExternalBlob instances. For each video, call the uploadVideo mutation from useQueries.ts with name, description, and blob data. Track upload progress using ExternalBlob.withUploadProgress() and display progress indicators. Show success messages after all uploads complete and trigger video gallery refresh by invalidating the 'videos' query key."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement the useUploadVideo mutation hook that calls actor.uploadVideo with VideoUploadRequest data (name, description, blob). Configure the mutation to invalidate the 'videos' query key on success to trigger automatic gallery refresh. Add proper error handling and return mutation state for UI feedback."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Connect EventManagementSection create form to backend event creation handler with optional image upload",
      "acceptanceCriteria": [
        "Event creation form includes optional image file input",
        "Form validates required fields (name, description, date) before submission",
        "Selected image file is converted to ExternalBlob using upload-utils",
        "Create mutation sends all event data including optional image to backend",
        "Success message appears after event is created",
        "Events list refreshes to show the newly created event with image if provided"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/EventManagementSection.tsx",
          "operation": "modify",
          "description": "Add an optional file input field to the event creation form for image uploads. Implement form validation to ensure required fields (name, description, date) are present before submission. When an image is selected, convert it to ExternalBlob using upload-utils.ts. Update the form submission handler to call the createEvent mutation from useQueries.ts with EventCreateRequest data including name, description, date (converted using time-utils.ts), optional password, and optional image blob. Display success messages after creation and clear the form."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement the useCreateEvent mutation hook that calls actor.createEvent with EventCreateRequest data. Configure the mutation to invalidate the 'events' query key on success to trigger automatic events list refresh. Add proper error handling and return mutation state for UI feedback."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Connect OrdersSection create form to backend order creation handler with complete validation and line items",
      "acceptanceCriteria": [
        "Order creation form validates customer name (non-empty string)",
        "Phone number field accepts standard phone formats",
        "OrderLineItemsEditor allows adding multiple items with name, quantity, and price",
        "Form validates that at least one line item exists before submission",
        "Delivery address field is validated as non-empty",
        "Payment amount is automatically calculated from line item totals",
        "Payment method selection is required (Cash, Card, or Online)",
        "Create mutation sends complete order data to backend",
        "Success message appears after order is created",
        "Orders list refreshes to show the newly created order with all details"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/OrdersSection.tsx",
          "operation": "modify",
          "description": "Enhance the order creation form to validate customer name as non-empty string, add phone number validation, ensure at least one line item exists using OrderLineItemsEditor, and validate delivery address field. Implement automatic payment total calculation from line items using order-utils.ts. Add payment method selection with required validation. Update the form submission handler to convert dates using time-utils.ts, construct CreateOrderRequest with all order fields (customerName, orderDate, fulfillDate, numberOfDvd, items array, numberOfPrints, payment fields), and call the createOrder mutation from useQueries.ts. Display success messages and clear the form after successful creation."
        },
        {
          "path": "frontend/src/components/admin/OrderLineItemsEditor.tsx",
          "operation": "modify",
          "description": "Ensure the OrderLineItemsEditor component properly validates each line item has itemName, quantity (positive integer), and unitPrice (positive amount). Implement proper syncing with the parent OrdersSection form to calculate totals. Add UI feedback for validation errors on individual line items."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement the useCreateOrder mutation hook that calls actor.createOrder with CreateOrderRequest data. Configure the mutation to invalidate the 'orders' query key on success to trigger automatic orders list refresh. Add proper error handling and return mutation state for UI feedback."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Update PhotosViewer to fetch and display photos from backend with blob rendering",
      "acceptanceCriteria": [
        "PhotosViewer fetches photos using usePhotos query with selected sort order",
        "Each photo displays name, description, and category from backend data",
        "Photo blobs are converted to displayable URLs using blob-utils",
        "Grid layout displays photos responsively",
        "Loading state shows while photos are being fetched",
        "Empty state message displays when no photos exist",
        "Error state displays if photo fetch fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PhotosViewer.tsx",
          "operation": "modify",
          "description": "Replace placeholder content with usePhotos query hook from useQueries.ts, passing the selected sort order. Map the returned Photo array to display each photo's name, description, and category. Convert photo.blob to displayable image URLs using blob-utils.ts externalBlobToUrl() function. Implement responsive grid layout using Tailwind CSS. Add loading spinner while isLoading is true. Display empty state message when photos array is empty. Add error state UI when query error exists."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement the usePhotos query hook that calls actor.getPhotos() (or similar backend method to list photos) with the provided sort order parameter. Configure query to refetch on window focus and cache results appropriately. Return query state including data, isLoading, and error for component consumption."
        },
        {
          "path": "frontend/src/pages/PhotosPage.tsx",
          "operation": "modify",
          "description": "Ensure PhotosPage properly passes the selected sort order state to PhotosViewer component. Wire up the sort control dropdown to update the sort order state that PhotosViewer consumes."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Update VideosPage to fetch and display videos from backend with playable video rendering",
      "acceptanceCriteria": [
        "VideosPage fetches videos using useVideos query with selected sort order",
        "Each video displays name and description from backend data",
        "Video blobs are converted to playable URLs using blob-utils",
        "HTML5 video player renders each video with standard controls",
        "Loading state shows while videos are being fetched",
        "Empty state message displays when no videos exist",
        "Error state displays if video fetch fails"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/VideosPage.tsx",
          "operation": "modify",
          "description": "Update the useVideos query hook call to fetch videos with the selected sort order. Map the returned Video array to render each video's name and description. Convert video.blob to playable video URLs using blob-utils.ts externalBlobToUrl() function. Render HTML5 video elements with controls attribute, setting the src to the converted blob URL. Implement loading spinner while isLoading is true. Display empty state message when videos array is empty. Add error state UI when query error exists. Ensure videos are displayed in a responsive layout."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement the useVideos query hook that calls actor.getVideos() (or similar backend method to list videos) with the provided sort order parameter. Configure query to refetch on window focus and cache results appropriately. Return query state including data, isLoading, and error for component consumption."
        }
      ]
    }
  ]
}